/*
Дан массив nums, в котором можно выполнять следующую операцию любое количество раз: 

Выбрать соседнюю пару с минимальной суммой в nums. Если таких пар несколько, выбрать крайнюю левую. 
Заменить пару на их сумму. 
Вернуть минимальное количество операций, необходимых для того, чтобы массив стал неубывающим. 

Массив называется неубывающим, если каждый его элемент больше или равен предыдущему элементу (если он существует).

Пример 1:

Входные данные: nums = [5,2,3,1]
Выходные данные: 2

Пояснение:
Сумма чисел в паре (3,1) минимальна и равна 4. После замены nums = [5,2,4].
Сумма чисел в паре (2,4) минимальна и равна 6. После замены nums = [5,6].
Массив nums стал неубывающим за две операции.

Пример 2:
Входные данные: nums = [1,2,2]
Выходные данные: 0

Пояснение:
Массив nums уже отсортирован
*/

function minimumPairRemoval(nums: number[]): number {
    
    for(){}
    
    return 0
};